OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18lf45j50.h
#define _MSK0                   0x01
#define _MSK01                  0x01
#define _MSK1                   0x02
#define _MSK11                  0x02
#define _MSK2                   0x04
#define _MSK21                  0x04
#define _MSK3                   0x08
#define _MSK31                  0x08
#define _MSK4                   0x10
#define _MSK41                  0x10
#define _MSK5                   0x20
#define _MSK51                  0x20
#define _MSK6                   0x40
#define _MSK61                  0x40
#define _MSK7                   0x80
#define _MSK71                  0x80

//==============================================================================


//==============================================================================
//        SSP1MSK Bits

extern __at(0x0FC8) __sfr SSP1MSK;

typedef union
  {
  struct
    {
    unsigned MSK0               : 1;
    unsigned MSK1               : 1;
    unsigned MSK2               : 1;
    unsigned MSK3               : 1;
    unsigned MSK4               : 1;
    unsigned MSK5               : 1;
    unsigned MSK6               : 1;
    unsigned MSK7               : 1;
    };

  struct
    {
    unsigned MSK01              : 1;
    unsigned MSK11              : 1;
    unsigned MSK21              : 1;
    unsigned MSK31              : 1;
    unsigned MSK41              : 1;
    unsigned MSK51              : 1;
    unsigned MSK61              : 1;
    unsigned MSK71              : 1;
    };
  } __SSP1MSKbits_t;

extern __at(0x0FC8) volatile __SSP1MSKbits_t SSP1MSKbits;

#define _SSP1MSK_MSK0           0x01
#define _SSP1MSK_MSK01          0x01
#define _SSP1MSK_MSK1           0x02
#define _SSP1MSK_MSK11          0x02
#define _SSP1MSK_MSK2           0x04
#define _SSP1MSK_MSK21          0x04
#define _SSP1MSK_MSK3           0x08
#define _SSP1MSK_MSK31          0x08
#define _SSP1MSK_MSK4           0x10
#define _SSP1MSK_MSK41          0x10
#define _SSP1MSK_MSK5           0x20
#define _SSP1MSK_MSK51          0x20
#define _SSP1MSK_MSK6           0x40
#define _SSP1MSK_MSK61          0x40
#define _SSP1MSK_MSK7           0x80
#define _SSP1MSK_MSK71          0x80

//==============================================================================


//==============================================================================
//        SSPADD Bits

extern __at(0x0FC8) __sfr SSPADD;

typedef union
  {
  struct
    {
    unsigned MSK0               : 1;
    unsigned MSK1               : 1;
    unsigned MSK2               : 1;
    unsigned MSK3               : 1;
    unsigned MSK4               : 1;
    unsigned MSK5               : 1;
    unsigned MSK6               : 1;
    unsigned MSK7               : 1;
    };

  struct
    {
    unsigned MSK01              : 1;
    unsigned MSK11              : 1;
    unsigned MSK21              : 1;
    unsigned MSK31              : 1;
    unsigned MSK41              : 1;
    unsigned MSK51              : 1;
    unsigned MSK61              : 1;
    unsigned MSK71              : 1;
    };
  } __SSPADDbits_t;

extern __at(0x0FC8) volatile __SSPADDbits_t SSPADDbits;

#define _SSPADD_MSK0            0x01
#define _SSPADD_MSK01           0x01
#define _SSPADD_MSK1            0x02
#define _SSPADD_MSK11           0x02
#define _SSPADD_MSK2            0x04
#define _SSPADD_MSK21           0x04
#define _SSPADD_MSK3            0x08
#define _SSPADD_MSK31           0x08
#define _SSPADD_MSK4            0x10
#define _SSPADD_MSK41           0x10
#define _SSPADD_MSK5            0x20
#define _SSPADD_MSK51           0x20
#define _SSPADD_MSK6            0x40
#define _SSPADD_MSK61           0x40
#define _SSPADD_MSK7            0x80
#define _SSPADD_MSK71           0x80

//==============================================================================

extern __at(0x0FC9) __sfr SSP1BUF;
extern __at(0x0FC9) __sfr SSPBUF;

//==============================================================================
//        T2CON Bits

extern __at(0x0FCA) __sfr T2CON;

typedef union
  {
  struct
    {
    unsigned T2CKPS0            : 1;
    unsigned T2CKPS1            : 1;
    unsigned TMR2ON             : 1;
    unsigned T2OUTPS0           : 1;
    unsigned T2OUTPS1           : 1;
    unsigned T2OUTPS2           : 1;
    unsigned T2OUTPS3           : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned T2CKPS             : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned T2OUTPS            : 4;
    unsigned                    : 1;
    };
  } __T2CONbits_t;

extern __at(0x0FCA) volatile __T2CONbits_t T2CONbits;

#define _T2CKPS0                0x01
#define _T2CKPS1                0x02
#define _TMR2ON                 0x04
#define _T2OUTPS0               0x08
#define _T2OUTPS1               0x10
#define _T2OUTPS2               0x20
#define _T2OUTPS3               0x40

//==============================================================================

extern __at(0x0FCB) __sfr PR2;
extern __at(0x0FCC) __sfr TMR2;

//==============================================================================
//        T1CON Bits

extern __at(0x0FCD) __sfr T1CON;

typedef union
  {
  struct
    {
    unsigned TMR1ON             : 1;
    unsigned RD16               : 1;
    unsigned T1SYNC             : 1;
    unsigned T1OSCEN            : 1;
    unsigned T1CKPS0            : 1;
    unsigned T1CKPS1            : 1;
    unsigned TMR1CS0            : 1;
    unsigned TMR1CS1            : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned RD161              : 1;
    unsigned T1SYNC1            : 1;
    unsigned T1OSCEN1           : 1;
    unsigned T1CKPS01           : 1;
    unsigned T1CKPS11           : 1;
    unsigned TMR1CS01           : 1;
    unsigned TMR1CS11           : 1;
    };
  } __T1CONbits_t;

extern __at(0x0FCD) volatile __T1CONbits_t T1CONbits;

#define _TMR1ON                 0x01
#define _RD16                   0x02
#define _RD161                  0x02
#define _T1SYNC                 0x04
#define _T1SYNC1                0x04
#define _T1OSCEN                0x08
#define _T1OSCEN1               0x08
#define _T1CKPS0                0x10
#define _T1CKPS01               0x10
#define _T1CKPS1                0x20
#define _T1CKPS11               0x20
#define _TMR1CS0                0x40
#define _TMR1CS01               0x40
#define _TMR1CS1                0x80
#define _TMR1CS11               0x80

//==============================================================================

extern __at(0x0FCE) __sfr TMR1;
extern __at(0x0FCE) __sfr TMR1L;
extern __at(0x0FCF) __sfr TMR1H;

//==============================================================================
//        RCON Bits

extern __at(0x0FD0) __sfr RCON;

typedef union
  {
  struct
    {
    unsigned NOT_BOR            : 1;
    unsigned NOT_POR            : 1;
    unsigned NOT_PD             : 1;
    unsigned NOT_TO             : 1;
    unsigned NOT_RI             : 1;
    unsigned NOT_CM             : 1;
    unsigned                    : 1;
    unsigned IPEN               : 1;
    };

  struct
    {
    unsigned BOR                : 1;
    unsigned POR                : 1;
    unsigned PD                 : 1;
    unsigned TO                 : 1;
    unsigned RI                 : 1;
    unsigned CM                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __RCONbits_t;

